app/controllers/dashboard_controller.rb

  def index
    @user = current_user
    @workday = Workday.retrieve_current_workday(current_user)

    @current_time = get_current_time

    @time_punch = TimePunch.new
    @latest_time_punch = @workday.timePunches.last
---
SELECT  "time_punches".* FROM "time_punches" WHERE "time_punches"."workday_id" = $1  ORDER BY "time_punches"."id" DESC LIMIT 1  [["workday_id", 3]]