app/controllers/time_punches_controller.rb

  def create
    # @timePunch = @workday.timePunches.new

    if @workday.timePunches.count == 0
      @currentStatus = false
    else
      @lastTimePunch = @workday.timePunches.last
      @currentStatus = @lastTimePunch.clockedInStatus
      # newStatus = !@currentStatus
      # @currentStatus = true
    end

    # @timePunch.entry = Time.current
    # @timePunch.clockedInStatus = !@currentStatus
    # @timePunch.save
    @timePunch = @workday.timePunches.build(entry: Time.current, clockedInStatus: !@currentStatus )

    respond_to do |format|
      if @workday.save
---
SELECT COUNT(*) FROM "time_punches" WHERE "time_punches"."workday_id" = $1  [["workday_id", 3]]
SELECT  "time_punches".* FROM "time_punches" WHERE "time_punches"."workday_id" = $1  ORDER BY "time_punches"."id" DESC LIMIT 1  [["workday_id", 3]]
INSERT INTO "time_punches" ("entry", "clockedInStatus", "workday_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["entry", "2016-05-11 18:46:11.697822"], ["clockedInStatus", "t"], ["workday_id", 3], ["created_at", "2016-05-11 18:46:11.699335"], ["updated_at", "2016-05-11 18:46:11.699335"]]

    def set_workday
      @workday = Workday.find(params[:workday_id])
---
SELECT  "workdays".* FROM "workdays" WHERE "workdays"."id" = $1 LIMIT 1  [["id", 3]]